# Phase 2 Project

# Business Problem

Your company now sees all the big companies creating original video content and they want to get in on the fun. They have decided to create a new movie studio, but they don’t know anything about creating movies. You are charged with exploring what types of films are currently doing the best at the box office. You must then translate those findings into actionable insights that the head of your company's new movie studio can use to help decide what type of films to create.

## Business understading
The goal of this project is to guide the new movie studio in making data-driven decisions on the types of films they should produce to maximize box office success. By understanding the current landscape of the film industry, the company can make informed choices regarding budget allocation, genre focus, and release timing.

The key questions to address are:

1. **Which genres are most popular and how have they evolved over time?**

* Identify trends in film genres and determine which genres consistently perform well in terms of revenue and audience engagement.
2. **What is the relationship between production budgets and revenue**
* Understand if there is a correlation between production budgets and revenue (both domestic and worldwide), and how this relationship can inform the studio’s financial planning.
3. **How can the company determine the optimal budget for producing films in different genres to ensure a high ROI (Return on Investment)?**
* Find patterns or trends that show what budgets are needed for specific genres to maximize profit and minimize risk.
4. **What are the seasonal trends in the box office**
* Identify peak times for film releases and how they impact revenue performance, helping to determine the best times to release films.

# Data Understanding

To answer these business questions, several datasets are available, which include information on movie production, box office performance, and audience feedback:

- **Movie Basics Data (movie_basics table in im.db):**

Contains basic information about films, including the title, release year, genres, and runtime.
Key columns: movie_id, primary_title, genres, start_year, runtime_minutes.
- **Movie Ratings Data (movie_ratings table in im.db):**

Contains movie ratings from users and the number of votes, providing insights into audience reception.
Key columns: movie_id, averagerating, numvotes.
- **Financial Data (tn.movie_budgets.csv.gz):**

Contains financial information about the production budgets, domestic gross revenue, and worldwide gross revenue of movies.
Key columns: id, movie, production_budget, domestic_gross, worldwide_gross.
- **Movie Reviews Data (rt.reviews.tsv.gz):**

Contains professional critic reviews, including the rating, freshness of the review, and the publisher.
Key columns: id, movie, review, rating, fresh, critic, publisher.
- **Genre Information (rt.movie_info.tsv.gz):**

Contains detailed genre information for each movie, including popularity and genre categories.
Key columns: genre_ids, movie_id, genre.
- **Release and Box Office Data (movie_release_data table):**

Includes information about release dates and runtimes.
Key columns: movie_id, release_date, runtime.


By leveraging these datasets, the project will uncover trends and actionable insights to help the company make strategic decisions in film production and distribution.

In [10]:
# Importing the neccessary libraries
import pandas as pd
import sqlite3

#Establishing the connection to the database and viewing the tables present
conn = sqlite3.connect("im.db")
pd.read_sql("""
            SELECT *
              FROM sqlite_master
            """,conn)

,type,name,tbl_name,rootpage,sql
0,table,movie_basics,movie_basics,2,"CREATE TABLE ""movie_basics"" (\n""movie_id"" TEXT..."
1,table,directors,directors,3,"CREATE TABLE ""directors"" (\n""movie_id"" TEXT,\n..."
2,table,known_for,known_for,4,"CREATE TABLE ""known_for"" (\n""person_id"" TEXT,\..."
3,table,movie_akas,movie_akas,5,"CREATE TABLE ""movie_akas"" (\n""movie_id"" TEXT,\..."
4,table,movie_ratings,movie_ratings,6,"CREATE TABLE ""movie_ratings"" (\n""movie_id"" TEX..."
5,table,persons,persons,7,"CREATE TABLE ""persons"" (\n""person_id"" TEXT,\n ..."
6,table,principals,principals,8,"CREATE TABLE ""principals"" (\n""movie_id"" TEXT,\..."
7,table,writers,writers,9,"CREATE TABLE ""writers"" (\n""movie_id"" TEXT,\n ..."

In [11]:
movie_basics = pd.read_sql("""
SELECT *
FROM movie_basics
""",conn)
movie_basics

,movie_id,primary_title,original_title,start_year,genres
0,tt0063540,Sunghursh,Sunghursh,2013,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,"Comedy,Drama,Fantasy"
...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,Documentary

In [12]:
movie_ratings = pd.read_sql("""
SELECT * 
  FROM movie_ratings
""",conn)
movie_ratings

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [13]:
movie_budgets = pd.read_csv("Data/tn.movie_budgets.csv.gz")
movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [14]:
reviews = pd.read_csv("Data/rt.reviews.tsv.gz",sep='\t',encoding='latin1')
reviews

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"
...,...,...,...,...,...,...,...,...
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

In [15]:
movie_info = pd.read_csv("Data/rt.movie_info.tsv.gz",sep='\t')
movie_info

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1555,1996,Forget terrorists or hijackers -- there's a ha...,R,Action and Adventure|Horror|Mystery and Suspense,NaN,NaN,"Aug 18, 2006","Jan 2, 2007",$,"33,886,034",106 minutes,New Line Cinema
1556,1997,The popular Saturday Night Live sketch was exp...,PG,Comedy|Science Fiction and Fantasy,Steve Barron,Terry Turner|Tom Davis|Dan Aykroyd|Bonnie Turner,"Jul 23, 1993","Apr 17, 2001",NaN,NaN,88 minutes,Paramount Vantage
1557,1998,"Based on a novel by Richard Powell, when the l...",G,Classics|Comedy|Drama|Musical and Performing Arts,Gordon Douglas,NaN,"Jan 1, 1962","May 11, 2004",NaN,NaN,111 minutes,NaN
1558,1999,The Sandlot is a coming-of-age story about a g...,PG,Comedy|Drama|Kids and Family|Sports and Fitness,David Mickey Evans,David Mickey Evans|Robert Gunter,"Apr 1, 1993","Jan 29, 2002",NaN,NaN,101 minutes,NaN
1559,2000,"Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,NaN,Luc Besson,"Sep 27, 2001","Feb 11, 2003",NaN,NaN,94 minutes,Columbia Pictures

In [16]:
movies = pd.read_csv("Data/tmdb.movies.csv.gz",index_col=0)
movies

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...
26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

 ## 1. DATA CLEANING AND PREPARATION WITH PYTHON

In [18]:
# STARTING WITH movie_info
#CHEck for null values
movie_info.isnull().sum()

id                 0
synopsis          62
rating             3
genre              8
director         199
writer           449
theater_date     359
dvd_date         359
currency        1220
box_office      1220
runtime           30
studio          1066
dtype: int64

In [19]:

#Since the common currency used is the dollar, we replace all the null values with the '$' symbol.
movie_info['currency'].fillna('$')

0       $
1       $
2       $
3       $
4       $
       ..
1555    $
1556    $
1557    $
1558    $
1559    $
Name: currency, Length: 1560, dtype: object

In [20]:
#Drop all rows with missing values.
movie_info_cleaned = movie_info.dropna()

In [21]:
movie_info_cleaned.isna().sum()

id              0
synopsis        0
rating          0
genre           0
director        0
writer          0
theater_date    0
dvd_date        0
currency        0
box_office      0
runtime         0
studio          0
dtype: int64

In [22]:
#Check for missing values in the reviews data set.
reviews.isnull().sum()

id                0
review         5563
rating        13517
fresh             0
critic         2722
top_critic        0
publisher       309
date              0
dtype: int64

In [23]:
reviews.head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

reviews data is in string format,therefore the large presence of null values won't impact our analysis.

In [25]:
movie_budgets = pd.read_csv("Data/tn.movie_budgets.csv.gz")
movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [26]:
movie_budgets.isnull().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

movie_budgets data is clean with no null values.

In [28]:
movies = pd.read_csv("Data/tmdb.movies.csv.gz",index_col=0)
movies

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...
26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

In [29]:
movies.isnull().sum()

genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

movies data is also clean with no null values.

# Checking for outliers in the movies,movie_info & movie_budgets datasets

In [32]:
movie_budgets.describe()

                id
count  5782.000000
mean     50.372363
std      28.821076
min       1.000000
25%      25.000000
50%      50.000000
75%      75.000000
max     100.000000

In [33]:
movies.describe()

                  id    popularity  vote_average    vote_count
count   26517.000000  26517.000000  26517.000000  26517.000000
mean   295050.153260      3.130912      5.991281    194.224837
std    153661.615648      4.355229      1.852946    960.961095
min        27.000000      0.600000      0.000000      1.000000
25%    157851.000000      0.600000      5.000000      2.000000
50%    309581.000000      1.374000      6.000000      5.000000
75%    419542.000000      3.694000      7.000000     28.000000
max    608444.000000     80.773000     10.000000  22186.000000

# Merging and joining datasets

In [35]:
# Merge movie_basics and movie_ratings
movie_data = pd.merge(movie_basics, movie_ratings, on='movie_id', how='inner')

movie_data.head()

,movie_id,primary_title,original_title,start_year,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,"Comedy,Drama,Fantasy",6.5,119

In [67]:
# Convert relevant columns to numeric for movie_budgets
movie_budgets['production_budget'] = movie_budgets['production_budget'].astype(str).str.replace(r'[$,]', '', regex=True).astype(int)

movie_budgets['domestic_gross'] = movie_budgets['domestic_gross'].astype(str).str.replace(r'[$,]', '', regex=True).astype(int)

In [79]:
#movie_budgets['worldwide_gross'] = movie_budgets['worldwide_gross'].astype(str).str.replace(r'[$,]', '', regex=True).astype(int)
# Convert 'worldwide_gross' to string, remove $ and commas, then convert to float
movie_budgets['worldwide_gross'] = movie_budgets['worldwide_gross'].astype(str).str.replace(r'[$,]', '', regex=True).astype(float)

In [81]:
# Merge movie data with movie budgets.  Need to clean movie titles to do this.

movie_budgets['movie'] = movie_budgets['movie'].str.lower()

movie_data['primary_title'] = movie_data['primary_title'].str.lower()

movie_data = pd.merge(movie_data, movie_budgets, left_on='primary_title', right_on='movie', how='inner')

movie_data.head()

,movie_id,primary_title,original_title,start_year,genres,averagerating,numvotes,id_x,release_date_x,movie_x,production_budget_x,domestic_gross_x,worldwide_gross_x,id_y,release_date_y,movie_y,production_budget_y,domestic_gross_y,worldwide_gross_y
0,tt0249516,foodfight!,Foodfight!,2012,"Action,Animation,Comedy",1.9,8248,26,"Dec 31, 2012",foodfight!,45000000,0,"$73,706",26,"Dec 31, 2012",foodfight!,45000000,0,7.370600e+04
1,tt0337692,on the road,On the Road,2012,"Adventure,Drama,Romance",6.1,37886,17,"Mar 22, 2013",on the road,25000000,720828,"$9,313,302",17,"Mar 22, 2013",on the road,25000000,720828,9.313302e+06
2,tt0359950,the secret life of walter mitty,The Secret Life of Walter Mitty,2013,"Adventure,Comedy,Drama",7.3,275300,37,"Dec 25, 2013",the secret life of walter mitty,91000000,58236838,"$187,861,183",37,"Dec 25, 2013",the secret life of walter mitty,91000000,58236838,1.878612e+08
3,tt0365907,a walk among the tombstones,A Walk Among the Tombstones,2014,"Action,Crime,Drama",6.5,105116,67,"Sep 19, 2014",a walk among the tombstones,28000000,26017685,"$62,108,587",67,"Sep 19, 2014",a walk among the tombstones,28000000,26017685,6.210859e+07
4,tt0369610,jurassic world,Jurassic World,2015,"Action,Adventure,Sci-Fi",7.0,539338,34,"Jun 12, 2015",jurassic world,215000000,652270625,"$1,648,854,864",34,"Jun 12, 2015",jurassic world,215000000,652270625,1.648855e+09

In [71]:
movie_data.columns

Index(['movie_id', 'primary_title', 'original_title', 'start_year', 'genres',
       'averagerating', 'numvotes', 'id', 'release_date', 'movie',
       'production_budget', 'domestic_gross', 'worldwide_gross'],
      dtype='object')

In [83]:
# Drop rows with any null values
movie_data = movie_data.dropna()
movie_data.head()

,movie_id,primary_title,original_title,start_year,genres,averagerating,numvotes,id_x,release_date_x,movie_x,production_budget_x,domestic_gross_x,worldwide_gross_x,id_y,release_date_y,movie_y,production_budget_y,domestic_gross_y,worldwide_gross_y
0,tt0249516,foodfight!,Foodfight!,2012,"Action,Animation,Comedy",1.9,8248,26,"Dec 31, 2012",foodfight!,45000000,0,"$73,706",26,"Dec 31, 2012",foodfight!,45000000,0,7.370600e+04
1,tt0337692,on the road,On the Road,2012,"Adventure,Drama,Romance",6.1,37886,17,"Mar 22, 2013",on the road,25000000,720828,"$9,313,302",17,"Mar 22, 2013",on the road,25000000,720828,9.313302e+06
2,tt0359950,the secret life of walter mitty,The Secret Life of Walter Mitty,2013,"Adventure,Comedy,Drama",7.3,275300,37,"Dec 25, 2013",the secret life of walter mitty,91000000,58236838,"$187,861,183",37,"Dec 25, 2013",the secret life of walter mitty,91000000,58236838,1.878612e+08
3,tt0365907,a walk among the tombstones,A Walk Among the Tombstones,2014,"Action,Crime,Drama",6.5,105116,67,"Sep 19, 2014",a walk among the tombstones,28000000,26017685,"$62,108,587",67,"Sep 19, 2014",a walk among the tombstones,28000000,26017685,6.210859e+07
4,tt0369610,jurassic world,Jurassic World,2015,"Action,Adventure,Sci-Fi",7.0,539338,34,"Jun 12, 2015",jurassic world,215000000,652270625,"$1,648,854,864",34,"Jun 12, 2015",jurassic world,215000000,652270625,1.648855e+09